package openssl.jesson.com.openssl;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.util.Base64;
import android.util.Log;
import android.widget.TextView;

public class MainActivity extends AppCompatActivity {

    private static final String TEST_DATA = "13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—13bcdfasg5456!@#$%^&*()_+=~`/|?><:'-+*./数据加解密测试—";

    private static final String TAG = "openssl";


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        JNIUTILS jniutils = new JNIUTILS();
        Log.i(TAG, "原始数据长度：->" + TEST_DATA.length());
        byte[] encodeByHmacSHA1 = jniutils.encodeByHmacSHA1(this, TEST_DATA.getBytes());
        String hmacSHA1 = Base64.encodeToString(encodeByHmacSHA1, Base64.NO_WRAP);
        Log.i(TAG, "hmacSHA1签名编码->" + hmacSHA1 + "\n签名长度->" + hmacSHA1.length());

    }


}
